[
  {
    "path": "posts/2021-05-24-my-first-post/",
    "title": "Data Viz Makeover 1",
    "description": "A Visualisation of Singapore's Merchandise Trade Volume with it's Top 6 Countries",
    "author": [
      {
        "name": "Aryah U. Chopra",
        "url": "https://www.linkedin.com/in/aryahuc/"
      }
    ],
    "date": "2021-05-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1: Introduction\r\n2: Original Data Visualization2.1: Critique: Clarity\r\n2.1: Critique: Aesthetics\r\n\r\n3: Design Sketches\r\n4. Building the Alternative Design4.1 The Data\r\n4.2 Data Preparation\r\n4.3 Creating the Chart\r\n\r\n5. Final Visualization\r\n6. Insights\r\n\r\n1: Introduction\r\nThe data in hand is the Merchandise Trade volume of Singapore with it’s top 6 trade partners in 2019 and 2020.\r\nThey are identified as:\r\nChina (Mainland)\r\nHong Kong\r\nMalaysia\r\nJapan\r\nTaiwan\r\nUnited States of America\r\nThis period of time is especially crucial (and interesting) as it is one of the most tumultuous times the world has faced, with nearly all sectors taking a massive hit – The COVID-19 Pandemic.\r\nThe data was retrieved from the Department of Statistics, Singapore (DOS).\r\n2: Original Data Visualization\r\nThe following is the original chart that was prepared:\r\n\r\n\r\n\r\nFigure 1: Original Chart\r\n\r\n\r\n\r\nThis visualization will be critiqued on two parameters: Clarity and Aesthetics.\r\n2.1: Critique: Clarity\r\nClarity is how clear/lucid the chart in it’s message to the reader. The information should be free of ambiguity and confusion.\r\nThe chart falters as such:\r\nTitle: The title of the graph says “2019 - 2020”. This creates a level of ambiguity as we’re not sure as to if it is from Jan 2019 - Dec 2020 or Jan 2019 - Jan 2020 and so forth.\r\nThe x-axis adds to the ambiguity of the title. For example, for the Japan panel, there is only 2020 whereas for the others, there is 2019 - 2021.\r\nExample:\r\n\r\n\r\n\r\nFigure 2: Misleading Title\r\n\r\n\r\n\r\nMismatch of Axis: The x-axis is labeled as ‘Month of Period’, however, the ticks are labeled by the year.\r\nExample:\r\n\r\n\r\n\r\nFigure 3: Misleading x-axis\r\n\r\n\r\n\r\nMismatched Dual-Axis: The import and export y-axis scales are not synchronized, as a result it creates ambiguity.\r\nExample:\r\n\r\n\r\n\r\nFigure 4: Mismatched Dual Axis\r\n\r\n\r\n\r\nIn the case of Hong Kong:\r\nThere is the illusion that exports are only slightly higher than the import volume across any one time period, however that is not the case. In fact, the exports are much higher than the imports.\r\nAlso, Hong Kong is actually net importer of Singapore and that information is not visible on the graph.\r\nIn the case of Taiwan:\r\nThere is the illusion that exports and imports are comparable. However, Taiwan is a net exporter of Singapore and that information is not visible at the first glance.\r\nSince the countries are all on separate and unsynchronized axis, it is hard to make comparison between them.\r\nFor example, if one were to study the chart carefully, we can see that there is a huge trade surplus with Hong Kong as compared to other countries.\r\nIn addition to that, there is we’re unable to see which country trades with Singapore the most.\r\nThere is no mention of the source of data. This makes it unclear to the user as to whether the chart comes from a reliable data source or not.\r\nThe chart fails to indicate that the values indicated on the charts are in fact in billions or the currency it is in. The raw data is actually scaled down by a thousand.\r\n2.1: Critique: Aesthetics\r\nAesthetics, as the word suggests, the visual appeal of the chart.\r\nThe chart falters as such:\r\nThe alpha (opacity) ratio of the chart is too high. It creates a murky look to areas where the chart overlaps as shown below.\r\n\r\n\r\n\r\nFigure 5: Murky look\r\n\r\n\r\n\r\nThe compound line graph is perhaps not the correct visualization technique for this, and it is poorly executed as well.\r\nThe compound line graph is usually used so show the proportion of components that make up some aggregate variable. As such, the differences between the points across a certain time period would give actual values.\r\nDue to the unsynchronized axis, the difference cannot be seen.\r\nA line graph would be a better and cleaner visualization choice.\r\nThe labels for each panel of the facet grid is larger than the title. And the font type is also not standardized across the chart.\r\n\r\n\r\n\r\nFigure 6: Unchecked font sizes\r\n\r\n\r\n\r\nThe widths of each panel is not the same.\r\n\r\n\r\n\r\nFigure 7: Unequal Width of the Panel\r\n\r\n\r\n\r\nThe distance of the axis labels is also not standardized across the panels.\r\n\r\n\r\n\r\nFigure 8: Unequal distance of y-axis labels\r\n\r\n\r\n\r\n3: Design Sketches\r\nThe initial sketch of the chart:\r\n\r\n\r\n\r\nFigure 9: Initial Sketch\r\n\r\n\r\n\r\nIssues Addressed\r\nClarity - Point 1 The title will be concise, implying year 2019 and 2020. In addition to that, it will state that the import and export terms are relative to Singapore.\r\nClarity - Point 2 X-axis will be marked according to Month, with only the major ticks labeled. This will remove ambiguity from the previous design and also not crowd the axis too much.\r\nClarity - Point 3 & Point 4 The dual axis will by synchronized and shared between countries so that directly comparison can be made between countries as well as within their respective imports and exports.\r\nClarity - Point 5 The source of the data will included at the bottom of the chart. This will not only highlight that the data is from a reliable source, but also highlight that the import and export is relative to Singapore.\r\nClarity - Point 6 For the Import and Export values, the raw value in billions will be reflected and the currency will also be stated as (SGD).\r\nAesthetics - Point 1 & Point 2 A line chart will be used so that the movements of the graph are clear. In addition to that, another chart will be created, Export - Import, to see the difference in values which perhaps the earlier visualization tried to show using a compound line chart.\r\nAesthetics - Point 3 The label of the title will be larger than that of the countries as well as the font type.\r\nAesthetics - Point 4 & Point 5 The facet will be equally split into 6 panels, one for each country and the axis will be shared. This will ensure that they are of equal size.\r\n4. Building the Alternative Design\r\n4.1 The Data\r\nThe raw data is in .xlsx format.\r\nIt contains 2 sheets:\r\nT1 : Merchandise Imports by Region/Market, Monthly\r\nT2 : Merchandise Exports by Region/Market, Monthly\r\nThe figure below shows a snapshot of the data:\r\n\r\n\r\n\r\nFigure 10: Snapshot of the raw data\r\n\r\n\r\n\r\nThings to Note:\r\nData starts at Row 6\r\nThe dates are in columns i.e. data needs to be transposed\r\nThe 6 countries need to be filtered out\r\n4.2 Data Preparation\r\nFirst, launch the Tableau Desktop software.\r\nImport the Data. From the local directory where the Raw_Data.csv is saved, drag and drop into the homepage as shown:\r\n\r\n\r\n\r\nFigure 11: Tableau Start Page\r\n\r\n\r\n\r\nWe will see this screen once the data is loaded.\r\n\r\n\r\n\r\nFigure 12: Tableau Workspace\r\n\r\n\r\n\r\nAs discussed previously, since the data only begins at row 6 (and also has other information row 100 onwards), we will tick the Data Interpreter before dragging tables into the workspace.\r\n\r\n\r\n\r\nFigure 13: Data Interpreter\r\n\r\n\r\n\r\nDrag T1 into the workspace. The data, highlighted in purple, will appear.\r\n\r\n\r\n\r\nFigure 14: T1 Data Preview\r\n\r\n\r\n\r\nCountry Filter\r\nSince, we only require the 6 countries, a filter will be applied.  The sequence steps are highlighted in the following:\r\nClick on the Add|Filter button (Box 1) and then Add..(Box 2)\r\n\r\n\r\n\r\nFigure 15: Adding filter\r\n\r\n\r\n\r\nSelect Variables and Click Ok\r\n\r\n\r\n\r\nFigure 16: Select Variables\r\n\r\n\r\n\r\nSelect all the 6 Countries that were listed: Mainland China, Malaysia, Hong Kong, Taiwan, United States, Japan\r\n\r\n\r\n\r\nFigure 17: Select Countries\r\n\r\n\r\n\r\nWe will see the filter added as shown below. Register the changes by clicking Ok\r\n\r\n\r\n\r\nFigure 18: Commit the changes\r\n\r\n\r\n\r\nPivot the table.\r\nSelect all the columns: Click the first column + shift + Click the last column.  Right click to get the drop down list as shown below, and select Pivot\r\n\r\n\r\n\r\nFigure 19: Pivot table\r\n\r\n\r\n\r\nNow, the data looks like:\r\n\r\n\r\n\r\nFigure 20: Output of Pivotted Table\r\n\r\n\r\n\r\nFormatting & Renaming the columns.\r\nFormatting:\r\nSelect the Abc icon (which indicates string format) on the top left hand corner of the date column as shown in Box.\r\nRight click and select Date. This will change the format of the column.\r\n\r\n\r\n\r\nFigure 21: Changing Date Format\r\n\r\n\r\n\r\nRenaming:\r\nRight click on the column one-by-one and select Rename. Rename the respective columns to Date, Import Value and Country\r\n\r\n\r\n\r\nFigure 22: Renaming the Columns\r\n\r\n\r\n\r\nThe data looks as shown below:\r\n\r\n\r\n\r\nFigure 23: Output after Rename & Format change\r\n\r\n\r\n\r\nDate Filter\r\nSince we only require years 2019 & 2020, we will add another filter.\r\nThe steps are shown below:\r\n\r\n\r\n\r\nFigure 24: Adding Year filter\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 25: Select Data variable\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 26: Selecting Years\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 27: Selecting 2019 & 2020\r\n\r\n\r\n\r\nSave the file as Import_Data.csv\r\nIn the top row of icons, click on Export Data to CSV as shown below:\r\n\r\n\r\n\r\nFigure 28: Commit the Changes\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 29: Exporting the Data\r\n\r\n\r\n\r\nRepeat the steps above for T2 and export the data as Export_Data.csv\r\nOpen a new session of Tableau and drag the newly created Import_Data.csv. Export_Data.csv will also appear.\r\nDrag the Import_Data.csv node into the workspace as shown.\r\n\r\n\r\n\r\nFigure 30: Drag Import_Data\r\n\r\n\r\n\r\nIf the Export_Data.csv file does not appear, go to Connections and click Add as shown below:\r\n\r\n\r\n\r\nFigure 31: Adding Export_Data.csv\r\n\r\n\r\n\r\nMerge the files. Now, we will merge the two .csv files on Date & Country. Double click on Import_data.csv in the workspace and then drag Export_Data.csv in. Next, click on the Venn Diagram icon add Date.\r\n\r\n\r\n\r\nFigure 32: Merging files\r\n\r\n\r\n\r\nThe data below will be updated and we will see as follows: We can see that the the icon in the Import_Data.csv node is updated to show that it is a merged table. Also, the columns are updated:\r\n\r\n\r\n\r\nFigure 33: Output of merge\r\n\r\n\r\n\r\nWe will also hide to two duplicate columns highlighted. Right click and select Hide\r\n\r\n\r\n\r\nFigure 34: Hide un-needed columns\r\n\r\n\r\n\r\nCreate aliases for country data\r\nRight click on the Country(Export_Data.csv) column and select Aliases...\r\nFor each of the countries, edit the countries and click ok.\r\n\r\n\r\n\r\nFigure 35: Create aliases\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 36: Type in the Country names\r\n\r\n\r\n\r\nCreate calculated fields\r\nAs the Export Value and Import Values are in thousands, we will scale it up by a factor of 1000 so that the raw values are reflected on the visualization.\r\nRight click on th Export Value (Thousands) column and select Create Calculated Field...  Next, we add the formula and label the calculation as Export Value. The process is shown below:\r\n\r\n\r\n\r\nFigure 37: Create calculated field: Scale up by thousand\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 38: Formula\r\n\r\n\r\n\r\nRepeat the process for the Import Value (Thousands) column and save it as Import Value\r\nWe will also create another calculated field called Export-Import:\r\n\r\n\r\n\r\nFigure 39: Create calculated field: Export-Import\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 40: Formula\r\n\r\n\r\n\r\n4.3 Creating the Chart\r\nOn the bottom left hand corner of window, click on the Sheet tab. This is where the chart is built.\r\nDrag and drop the variables (known as Measures in Tableau) into the are marked by Columns and Rows as shown below.\r\n\r\n\r\n\r\nFigure 41: Create chart\r\n\r\n\r\n\r\nChange year to month parameter by clicking on the square icon and selecting Month\r\n\r\n\r\n\r\nFigure 42: Change year to month\r\n\r\n\r\n\r\nCreate a dual axis\r\nHold and drag the Import Value to the right edge of the chart.\r\n\r\n\r\n\r\nFigure 43: Creating a dual axis\r\n\r\n\r\n\r\nOnce that is done, right click on the Import Value axis and select Synchronize Axis\r\n\r\n\r\n\r\nFigure 44: Synchronize axis\r\n\r\n\r\n\r\nA dual and synchronized axis allows us to compare the import and export for each country. This is especially useful in understanding the trade relationship between Singapore and the partner.\r\nEditing the X-axis\r\nRight click on the x-axis and select Edit Axis.\r\n\r\n\r\n\r\nFigure 45: Edit x-axis\r\n\r\n\r\n\r\nNext we make the changes shown below:\r\n\r\n\r\n\r\nFigure 46: General axis settings\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 47: Tick marks axis settings\r\n\r\n\r\n\r\nOnce the changes have been made, close the window. Right click on the axis again and select Format...\r\n\r\n\r\n\r\nFigure 48: Formating x-axis\r\n\r\n\r\n\r\nMake the following changes:\r\n\r\n\r\n\r\nFigure 49: Changes to x-axis format\r\n\r\n\r\n\r\nChanging the Chart Features\r\nSize of Line Chart: Select the All tab under the Marks card. Click the Size icon and toggle the sliding bar.\r\n\r\n\r\n\r\nFigure 50: Changing size of line chart\r\n\r\n\r\n\r\nType of Line Chart: Under the All tab select Color and click on the line icon. This will show the data points.\r\n\r\n\r\n\r\nFigure 51: Adding points to line chart\r\n\r\n\r\n\r\nHide Column Label: We can hide the column labels as it the Country names are self explanatory Right click and select Hide Field Labels for Column.\r\n\r\n\r\n\r\nFigure 52: Hide field label\r\n\r\n\r\n\r\nEdit Title: Right click on the title and select Edit Title...\r\n\r\n\r\n\r\nFigure 53: Editing title\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 54: Title to Add\r\n\r\n\r\n\r\nAdding Export-Import Drag and drop Export-Import twice on to the Rows bar.\r\n\r\n\r\n\r\nFigure 55: Creating second chart\r\n\r\n\r\n\r\nNext, we will click on the lower y-axis (red chart) and select Dual Axis.\r\n\r\n\r\n\r\nFigure 56: Select Dual Axis\r\n\r\n\r\n\r\nSynchronize the axis\r\n\r\n\r\n\r\nFigure 57: Synchonize Axis\r\n\r\n\r\n\r\nNow, we will change the one of the chart into a bar chart. Under the Marks card, select SUM(Export-Import)(2) (either of them would be fine) and select from the drop down, Bar.\r\n\r\n\r\n\r\nFigure 58: Change to bar chart\r\n\r\n\r\n\r\nOnce that is done, drag the Export-Import variable into the Color box and reduce the opacity.\r\n\r\n\r\n\r\nFigure 59: Adding color gradient to bar chart\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 60: Changing opacity\r\n\r\n\r\n\r\nEdit the legend With the newly created bar chart, we will change the color gradient so that it shows red for negative values and green for positive.\r\nThe steps are shown below:\r\n\r\n\r\n\r\nFigure 61: Settings for color gradient\r\n\r\n\r\n\r\nOnce that is done, we change the color and width of the line chart of the Export-Import chart.\r\nThe color of the line chart will follow the same color gradient as that of the bar chart, it will be created the same way as shown earlier, but this time dropping the measure onto the Color box in the line chart Marks card.\r\nChanging the grid lines.\r\nRight click anywhere on the chart and select Format...\r\n\r\n\r\n\r\nFigure 62: Formatting gridlines\r\n\r\n\r\n\r\nMake the following changes to get only vertical lines and not horizontal\r\n\r\n\r\n\r\nFigure 63: Column settings\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 64: Row settings\r\n\r\n\r\n\r\nAnnotations will be made in the chart.\r\nTo do so, right click, select Annotate and Point to make the annotation.\r\nFor further formatting to change the annotation bubble shape, right click on the text box and select Format\r\nLastly, caption will be added to refer to the data source.\r\nRight click on the bar right below the x-axis and select Caption. The caption box will appear and right click on that to make edits.\r\n\r\n\r\n\r\nFigure 65: Adding caption\r\n\r\n\r\n\r\nCurrently, the chart has lines extending outward as showing in the line highlighted in red.\r\n\r\n\r\n\r\nFigure 66: Extending lines on the Chart\r\n\r\n\r\n\r\nWe will remove those: Right click on a whitespace on chart, and select Format... Make the following changes:\r\n\r\n\r\n\r\nFigure 67: Remove Row Header Line\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 68: Remove Column Header Line\r\n\r\n\r\n\r\nThe final changes will be splitting this chart into two separate charts. At the bottom of the window, right click on the Sheet 1 tab and select duplicate:\r\n\r\n\r\n\r\nFigure 69: Duplicate sheet\r\n\r\n\r\n\r\nDouble click and rename the Sheet 1 as Import/Export and the duplicated sheet as Balance of Trade.\r\n\r\n\r\n\r\nFigure 70: Renaming the sheet\r\n\r\n\r\n\r\nNext, we will open the respective sheets and remove the other variables by right clicking and selecting remove.\r\n\r\n\r\n\r\nFigure 71: Remove variables\r\n\r\n\r\n\r\nImport/Export sheet We will retain the following:\r\n{r,fig.cap='Import/Export Sheet variables',out.width=335 } knitr::include_graphics(path='images/Picture_4-61.png') Balance of Trade sheet We will retain the following:\r\n\r\n\r\n\r\nFigure 72: Balance of Trade Sheet variables\r\n\r\n\r\n\r\nIn the Balance of Trade chart, add the title as shown below:\r\n\r\n\r\n\r\nFigure 73: Balance of Trade chart title\r\n\r\n\r\n\r\nCreate a dashboard by going to the bottom of the window and selecting New Dashboard\r\n\r\n\r\n\r\nFigure 74: Adding Dashboard\r\n\r\n\r\n\r\nIn the dashboard, drag and drop the sheets as shown below:\r\n\r\n\r\n\r\nFigure 75: Adding charts to Dashboard\r\n\r\n\r\n\r\nHover over the edges of the chart to resize.\r\n5. Final Visualization\r\nThe final chart can be found here:\r\nTableau Public Link\r\nIt is as follows:\r\n\r\n\r\n\r\nFigure 76: Final Visualization\r\n\r\n\r\n\r\n6. Insights\r\nChina\r\nWe can see that during the period of January & February (both 2019 and 2020) trade falls sharply. This can be likely due to Chinese New Year celebrations during which many of the businesses are closed in China and Singapore.\r\nWhile the dip in Singapore’s imports can be observed in both 2019 and 2020, Singapore’s exports dipped in February 2020 and not February 2019.\r\nThis could be partly due to the lockdown in Wuhan, China brought on by the Covid-19 pandemic. The lockdown was imposed on 23rd of January 2020.\r\nThere is a spike later in August 2020 which can be likely due to the recovering economy in China and increased demand for non-oil domestic exports(Nodx)\r\n\r\nHong Kong\r\nHong Kong is a net importer\r\nThe trade surplus with Hong Kong increased from 2019 to 2020\r\nIn 2019, Singapore’s imports increase from the period of February to April however, in 2020, the peak was much lower. This would be possibly due to the Pandemic with both countries seeing an uptick\r\nWhile in the previous year, exports increase from March to May, in 2020, the exports took a sharp dive. This is due to the circuit breaker in Singapore.\r\n\r\nJapan\r\nWhile the Balance of Trade suggests a general deficit, Singapore exported more from April to September 2020. This could likely be due to the pandemic.\r\nWith China’s lockdown in response to the pandemic disrupting supply chain, Japan’s economy took a hit.\r\nMalaysia\r\nThe Balance of Trade is approximately around 200 million but after April 2020, there is an increasing trade deficit.\r\nThe large dip seen in April 2020 is due to the restriction on movement in Malaysia as a measure to curb the spread of Covid-19.\r\nSoon after, the trade picks up as Malaysia opens its economy.\r\nTaiwan\r\nTaiwan is a net exporter\r\nThe trade deficit had reduced slight in December 2019, however it has deepened since.\r\nThe dip in December 2019 was likely due to the uncertainty shrouded by the US-China trade war & weakened commodity prices\r\n\r\nUnited States of America\r\nTrade with the US has mostly in a deficit\r\nThe Covid-19 pandemic turned that trend in March 2020 as US battled the pandemic.\r\nIn addition to that, USA’s reliance on medical and pharmaceutical good also boosted Singapore’s exports.\r\nIn August 2020, Singapore’s exports boosted due to increase demand for non-electronic goods\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-24-my-first-post/images/Picture1.png",
    "last_modified": "2021-05-29T18:03:15+08:00",
    "input_file": "my-first-post.utf8.md"
  }
]
