[
  {
    "path": "posts/2021-06-03-data-viz-makeover-2/",
    "title": "Data Viz Makeover 2",
    "description": "A Closer Look at Singapore's Trade Partners",
    "author": [
      {
        "name": "Aryah U. Chopra",
        "url": "https://www.linkedin.com/in/aryahuc/"
      }
    ],
    "date": "2021-06-03",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Original Data Visualization2.1: Critique: Clarity\r\n2.2: Critique: Aesthetics\r\n\r\n3: Redesign Sketches\r\n4. Building the Alternative Design4.1 The Data\r\n4.2 Data Preparation\r\n4.3 Creating the Chart\r\n\r\n5. Final Visualization\r\n6. Insights\r\n\r\n1. Introduction\r\nThe data in this makeover is the Merchandise Trade volume of Singapore from January 2011 to December 2020.\r\nThe data was retrieved from the Department of Statistics, Singapore (DOS).\r\n2. Original Data Visualization\r\n\r\n\r\n\r\nFigure 1: Original Visualization\r\n\r\n\r\n\r\nLink\r\n\r\n2.1: Critique: Clarity\r\nClarity is how clear/lucid the chart in it’s message to the reader. The information should be free of ambiguity and confusion.\r\nThe chart refers to 2020 trade data, however there is an excerpt is referring to 2006 and 2009.\r\n\r\n\r\n\r\nFigure 2: Chart quoting data out of context\r\n\r\n\r\n\r\nBy quoting that excerpt, the chart has quoted data out of context. In the Visual Display of Quantitative Information, 2nd Edition by Edward R. Tufte, he wrote about quoting data out of context. (pp. 74-76)  It would seem that the excerpt contains a key piece of information: The volatile trade dynamics between countries. \r\nThis chart does not answer the heart of quantitative thinking, “Compared to what?”. The bubble chart made an attempt to highlight that information by including the excerpt. Ultimately, the reader has questions left unanswered by the visuals itself.\r\nThe surface area of the graphic, size of the bubbles, does not represent the true proportions of the numbers. In correct visualizations, the size of the graphic should be directly proportional to the numerical quantities represented. We can quantify is using the Lie Factor.\r\nThe Lie Factor was first defined by Edward Tufte.(Tufte, 1983, p.54). The formula below: \\[ \r\n\\text{Lie Factor} = \\frac{\\text{size of effect shown in graphic}}{\\text{size of effect in data}}\r\n\\]\r\nThe ideal lie factor would be 1, i.e. the graphic shows the exact numerical proportion and as such the graph can be said to have graphical integrity (Tufte, 1983, p.50).\r\nFor example: Comparing the bubble of United States vs Japan.\r\nThe total volume of trade of USA is SGD 102.4 Bil and that of Japan is SGD 49.6 Bil. USA’s volume is approximately 51.6% greater than that of Japan: \\[ \r\n\\text{Size of effect in data} = \\frac{102.4 - 49.6}{102.4} * 100 = 51.56\\% \r\n\\]\r\nComparing the diameters of the circle, USA bubble’s radius is roughly 2.18 cm and Japan’s is 1.05 cm. If we get the area of the circles and compute the magnitude of difference, USA’s bubble is 73.8% bigger than Japan’s: \\[ \r\n\\text{Size of effect in shown in graphic} = \\frac{(2.18^2 - 1.05^2)}{(2.18^2)} * 100 =  76.8\\% \r\n\\]\r\nComputing the Lie Factor, we get: \\[ \r\n\\frac{75.9}{51.66} = 1.49 \r\n\\]\r\nThis tells us that the graphic has overstated the differences by 149%. In fact, if we observe the dimensions, we can see that the chart designer has linearly scaled the radius. \\[\r\n\\text{Given that United State's bubble was set at 2.18 cm: }\\\\\r\n\\text{ }\\\\\r\n\\text{Magnitude of Difference} = \\frac{102.4-49.6}{102.6} = 0.5166 \\\\\r\n\\text{Sizing of Japan's bubble} =\\frac{2.18*0.5166}{2.18} = 1.05\r\n\\]\r\nThis is incorrect as linearly scaling the radius results in quadrupled area. \\[\r\n\\text{Given that radius of the bigger circle = } r_{2} \\\\\\text{, radius of smaller circle = } r_{1} \\\\\r\n\\text{ When the radius is linearly scaled i.e. } r_{2} = 2*r_{1}  \\\\\r\n\\text{Ratios of the Circles = } \\frac{\\text{Bigger Circle}}{\\text{Smaller Circle}} = \\frac{\\pi (2r_{1})^2}{\\pi r_{1}} = 4 \\\\\r\n\\] Instead the areas of the circles should be scaled.\r\nIf we wanted a lie factor of 1, i.e. true representation, the radius of Japan’s bubble should have been approximately 1.5 cm to correctly represent the relative volumes.\r\nBelow shows the visual difference the Lie factor makes:\r\n\r\n\r\n\r\nFigure 3: Comparing Japan vs United States\r\n\r\n\r\n\r\nThis occurs throughout the chart, for example, even with Thailand\r\n\r\n\r\n\r\nFigure 4: Comparing Thailand vs United States\r\n\r\n\r\n\r\nThe perceived measure versus the numerical measure is vastly different. This erodes the graphical integrity of the chart as it does not accurately represent the true relative proportions.\r\nThe one dimensional volume of trade (addition of import and export) is sized by a two dimensional parameter, area of the circle. The use of circle tend to magnify perceived size as it is a shape of bilateral symmetry.  The example below shows that even if the area is appropriately scaled, it not poorly perceived that value is twice until explicitly stated or calculated.\r\n\r\n\r\n\r\nFigure 5: Area as a poor metaphor of values\r\n\r\n\r\n\r\nDue to the placements of the bubbles on the chart, i.e. exports and imports coordinates, it is hard for the reader to understand the country’s ranking. For example, Malaysia versus United States. Malaysia ranks higher than United States in terms of Trade Volume, however it not clear. There is no visual hierarchy.\r\n\r\n\r\n\r\nFigure 6: Lack of Visual Hierarchy\r\n\r\n\r\n\r\nThe tag highlighting net exporter/net importer, as shown in the figure below, is unclear as these dynamics change over time. It could create confusion as the reader might understand that the trade dynamics of Singapore with said country is static, however, that is not the case. For example, in 2017, United States would have the tag of biggest net importer.\r\n\r\n\r\n\r\nFigure 7: Importer/Exporter Tags\r\n\r\n\r\n\r\nThe number of variables being explained on the chart exceed the dimensions of the chart. While the axis states Import and Export, the chart attempts to explains 5 phenomenons - Import, Export, Total Volume of Trade, Importer/Exporter roles, Comparison to 2009/2006.\r\nThis creates a messy chart as there are 5 different concepts, with neither fully explaining one. For example, if the reader would like to know the trade surplus with Singapore top net exporter, Hong Kong, he would be unable to do so as it is unclear from the chart.\r\nAs a circle is used, a shape of bilateral symmetry, the circumference of the circle also render a reading on the chart, either for export/import.\r\n2.2: Critique: Aesthetics\r\nAesthetics is the visual appeal of the graph.\r\nLow data-ink ratio Data-ink is the non-erasable core of a graphic (Tufte, 1983, p.88). It can be defined as shown below: \\[\r\n\\begin{align}\r\n\\text{Data-ink Ratio} & = \\frac{\\text{data-ink}}{\\text{total ink to print the graphic}} \\\\ \r\n& = 1 - \\text{proportion of a graphic that can be erased without loss of informaion}\r\n\\end{align}\r\n\\]\r\nIf the bubbles were to be removed, the center and labels kept, there will not be any loss of data-information. This makes either the circle or the tooltip redundant ink.\r\nThe axis is excessively labeled without much information as the reader is only able to get a range of values, but not the exact.\r\nThe color of the bubbles do not add information to the chart. In addition to that, some colors are repeated as well. This might lead to confusion leading the user to look up the Country labels.\r\nThe color of the bubbles in fact do not register any information as our eyes cannot map a trend to colorful signatures. In fact, we’re understanding more information from the labels rather than the color. It is, in fact, Chartjunk(Tufte, 1983, p. 102)\r\nThe overall sizing of the bubbles in relation to the size of the chart is too big. This results in the bubbles crowded and hence, overlapping.\r\nThe interactivity of the chart does not add any features to the chart. In fact, it seems that the interactivity was added as a measure to un-hide the overlapping bubbles.\r\nOther Minor critiques include:\r\nThe coordinate labels are far from the bubbles, and hence the reader must often trace on the chart to retrieve Import/Export values or to derive the Balance of Trade. The interactivity of the chart could have been better implemented.\r\nThe font type is san-serif, this might provide uneasy reading for the viewer.(Tufte, 1982, p.176)\r\nThe tooltip of China and Hong Kong is falling outside the area of the chart, as shown below.\r\n\r\n\r\n\r\nFigure 8: Tooltips escaping the chart\r\n\r\n\r\n\r\n3: Redesign Sketches\r\nThe rough idea of the dashboard and re-design will be like so:\r\n\r\n\r\n\r\nFigure 9: Proposed Re-design\r\n\r\n\r\n\r\nIssues Addressed:\r\nClarity Point 1: The user will be allowed control of the years and quarters. This enables the user to make comparison and does not quote data out of context. In addition to that, there can be comparison made using the Animations function in Tableau that allows the user to visually see the movement of countries in terms of ranking. This will also explain the dynamic nature of trading relationships between countries, often reflecting on the economic activity.\r\nClarity Point 2,3 & 4: The total volume of trade will not be mapped into the area of the bubbles.\r\nInstead, the country’s will be ranked from lowest trade volume to highest trade volume, going from left to right. The country flag / abbreviations will be used to mark the bubbles so as to increase the data-ink ratio. This way the user is immediately able to see and understand the rank of the countries as they will not be scattered on an Import/Export axis.\r\nThe country’s corresponding import and export will be plotted on a bar chart. As tableau sizes the bar charts vertically, since the width of the bar charts are constant, the relative proportions will be clearly perceived as it is using a one-dimensional object ( a vertical line ) to represent a one-dimensional variable(export, import or total volume of trade).\r\nClarity Point 5: Using Tableau’s tooltips, the country’s role as a importer/exporter will be prompted upon a hover. There will be a theme of colors used: Red, Blue, Purple and Green. These colors will be used throughout the chart so that the user is able to immediately understand what the colors signify.In addition to that, the Import and Export bars will also make it evident as to whether Singapore is in deficit or surplus with said country.\r\nClarity Point 6: To prevent overcrowding of information, the Balance of Trade chart will be created separately i.e. Supplementary Charts 1 and 2 shown above. This ensures that the no. of information carrying variables do not exceed the dimensions of the chart.\r\nAesthetics Point 1: The country’s identity will be informed using the country’s flag as well as the tooltip. This ensures no redundant ink and also increases the data-ink ratio.\r\nAesthetics Point 2 & 3: The axis will not be labeled excessively, instead reference lines, minimum points, maximum points and tooltips will be used to ensure maximum data-ink ratio\r\nAesthetics Point 4: Since we’ll be using the barchart instead, there is no issue of overlapping. The fonts will be selected appropriately.\r\nAesthetics Point 5: The year and filter toggle allows the user to interact the chart and also the charts will be linked up so that the same filter can be applied to all and different parameters can be compared.\r\nAesthetics Point 6: A serif font will be applied to the chart. As tooltips are activated upon toggle and wrapped within the chart by Tableau, there will be no issue on the overflow. The tooltips also allow the user to activitely retrieve information without having to look at the axis.\r\n4. Building the Alternative Design\r\n4.1 The Data\r\nThe raw data is in .xlsx format.\r\nIt contains 2 sheets:\r\nT1 : Merchandise Imports by Region/Market, Monthly\r\nT2 : Merchandise Exports by Region/Market, Monthly\r\nThe figure below shows a snapshot of the data:\r\n\r\n\r\n\r\nFigure 10: Snapshot of the raw data\r\n\r\n\r\n\r\n4.2 Data Preparation\r\nThe data was prepared using Tableau Prep Building.\r\nLoad the Data.First, drag and drop the data into the Home screen as shown below.\r\n\r\n\r\n\r\nFigure 11: Measures to Rows/Columns shelf\r\n\r\n\r\n\r\nOnce the data has loaded into the screen, select Use Data Interpreter. This will remove unnecessary rows and columns.\r\n\r\n\r\n\r\nFigure 12: Data Interpreter\r\n\r\n\r\n\r\nDrag and drop T1 into the workspace\r\n\r\n\r\n\r\nFigure 13: Drag and drop T1\r\n\r\n\r\n\r\nPivot the data. Since the dates are in the columns and the variables (Countries) are row data, we need to pivot the data.\r\nRight click on the Import node and select Pivot from the drop down.\r\n\r\n\r\n\r\nFigure 14: Select Pivot\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 15: Pivot Node\r\n\r\n\r\n\r\nOnce that is done, select the first date 1976 Apr + Shift + last date 2021 Mar. Drag and drop into the Pivoted Fields Section.\r\n\r\n\r\n\r\nFigure 16: Pivoting the date columns into rows\r\n\r\n\r\n\r\nCleaning the data:\r\nRight click on the Pivot Node and select Clean Step from the drop down list\r\n\r\n\r\n\r\nFigure 17: Adding the Clean node\r\n\r\n\r\n\r\nRename the columns as shown below. Change the Dates column to date format - Click on the Abc icon and select Date from the dropdown.\r\n\r\n\r\n\r\nFigure 18: Rename columns and change Date format\r\n\r\n\r\n\r\nFilter the dates Select the Dates pane and then click on Filter Values....\r\n\r\n\r\n\r\nFigure 19: Select the Data panel and then select Filter\r\n\r\n\r\n\r\nNext, add the following formula:\r\n\r\n\r\n\r\nFigure 20: Formula for Filter\r\n\r\n\r\n\r\nFilter the Country Since the data also contains data by continents as well, we have to filer. The data by continents are in millions.\r\nSelect the Country pane as we did above for dates, and add the following formula:\r\n\r\n\r\n\r\nFigure 21: Filtering out continents\r\n\r\n\r\n\r\nSlicing the country names. Since all the country names contain “Thousand Dollars”, we will extract only the country names using an Automatic Split as shown below.\r\n\r\n\r\n\r\nFigure 22: Extracting country names\r\n\r\n\r\n\r\nThe Import variable is scaled down by a thousand. Hence, we will use the raw values. This is done as shown below:\r\n\r\n\r\n\r\nFigure 23: Scaling up Import values by thousand\r\n\r\n\r\n\r\nOnce that is done, we will drag in T2. Rename the node as Exports.\r\n\r\n\r\n\r\nFigure 24: Adding Export data\r\n\r\n\r\n\r\nApply all the data preparation steps for Exports through a copy-paste of the flow.\r\nCopy the flow that was created for Imports (though a click and drag over the space). Right click and select Copy and then Paste in an empty area.\r\n\r\n\r\n\r\nFigure 25: Copy the Flow\r\n\r\n\r\n\r\nDrag the Exports node over the newly pasted flow and drop into the Add box.\r\n\r\n\r\n\r\nFigure 26: Connect Export node to data prep flow\r\n\r\n\r\n\r\nJoining the two tables.\r\nRight click on Import’s final step: Clean step and select Join.\r\n\r\n\r\n\r\nFigure 27: Creating Join node\r\n\r\n\r\n\r\nThe Join node will appear. Drag and drop the final step in the Export flow and drop it into the Union node as shown.\r\n\r\n\r\n\r\nFigure 28: Connecting Export node to Join\r\n\r\n\r\n\r\nThe workspace below will be prompted to add in the field for the join. Add the following:\r\n\r\n\r\n\r\nFigure 29: Selecting conditions for Join\r\n\r\n\r\n\r\nA right join is used as there are more countries in Import than Export. This is to prevent any loss of data before the Final Clean.\r\nRight click and add a Clean Step\r\n\r\n\r\n\r\nFigure 30: Final clean\r\n\r\n\r\n\r\nRemove all duplicated columns. Right click and select Remove.\r\nAdding Total Volume of Trade & Balance of Trade\r\nOnce the duplicated columns are removed, we will add 2 more calculated fields.\r\n\r\n\r\n\r\nFigure 31: Adding Balance of Trade and Total Volume\r\n\r\n\r\n\r\nRemove Null values\r\nBalance of Trade: There are null values for the balance of trade as data for export for these countries does not exist. The total value of these make up a small percentage of the total data and hence we will exclude them.\r\nRight click and select Exclude.\r\n\r\n\r\n\r\nFigure 32: Excluding null values for BOT\r\n\r\n\r\n\r\nTotal Volume of Trade: We will remove the rows where total volume of trade is zero.\r\nDo as shown below:\r\n\r\n\r\n\r\nFigure 33: Excluding null values for Total Volume\r\n\r\n\r\n\r\nRight click on the Final Clean node and select Preview in Tableau Desktop.\r\n\r\n\r\n\r\nFigure 34: Exporting to Tableau Desktop\r\n\r\n\r\n\r\nThe data is ready for visualization. Save the workbook in local directory.\r\n4.3 Creating the Chart\r\nRight click on the Country variable in the Data pane and select Aliases. We will change the names so that they appear shorter in the labels/tooltips.\r\n\r\n\r\n\r\nFigure 35: Adding aliases\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 36: Commit changes\r\n\r\n\r\n\r\nCreate the following worksheets shown below.\r\n\r\n\r\n\r\nFigure 37: Creating worksheets\r\n\r\n\r\n\r\nAccording to the sketch, we will create two overall charts: Overall Bar and Overall Line.\r\nThe re-visualization of the original chart will be prepared in two parts and then place together on the dashboard, Movement of Trade Partners, MOTP (1) and MOTP (2).\r\nThe supplementary charts are Balance of Trade and Overall Balance of Trade. The Balance of Trade chart will show the top 5 and bottom 5 in terms of balance of trade, whereas the Overall Balane of Trade will follow the Singapore’s account with said country from 2011 to 2020.\r\nCreating the first chart: Overall Bar\r\nDrag and drop the variables into the Rows and Columns\r\n\r\n\r\n\r\nFigure 38: Measures for Overall Bar\r\n\r\n\r\n\r\nThis will create 2 charts, one for the export and one for import on separate axis.\r\nUnder the All Marks card, change the chart type to Bar.\r\n\r\n\r\n\r\nFigure 39: Change to Bar chart\r\n\r\n\r\n\r\nBy doing so, we have changed both charts to a bar type.\r\nWe will invert the Import bar chart next. This is so that the reader can visually comprehend the total volume of trade at the particular Year.\r\nRight click on the Import y-axis and select Edit Axis...\r\n\r\n\r\n\r\nFigure 40: Inverting Import Chart\r\n\r\n\r\n\r\nWe will also truncate the bar chart and set the start point at SGD 350 Billion.\r\n\r\n\r\n\r\nFigure 41: Truncating bar chart\r\n\r\n\r\n\r\nSet the start point at SGD 350 Billion for Export axis too. Note that the start point should be set at 350 Billion for both.\r\n\r\n\r\n\r\nFigure 42: Repeat for Export chart\r\n\r\n\r\n\r\nWe will add reference lines. These reference lines will serve as markers instead of the axis ticks. This is to increase the data-ink ratio. As the chart is interactive, there is not much need for the axis markings.\r\nReference will be added at 2 points for both import and export: Minimum and Maximum. A third line will be added that will be shared between the two at 350 Billion. This is so that the reader knows the start point.  Right click on the Export y-axis and select Add Reference Line.\r\n\r\n\r\n\r\nFigure 43: Adding reference line\r\n\r\n\r\n\r\nAdd the following settings to the reference line.\r\n\r\n\r\n\r\nFigure 44: Configuring the position reference line\r\n\r\n\r\n\r\nOnce the line has been added to the chart, right click on the line and select Format.\r\n\r\n\r\n\r\nFigure 45: Formating the line\r\n\r\n\r\n\r\nThe Format pane will be prompted on the left. Under Alignment set the display to be in the center.\r\n\r\n\r\n\r\nFigure 46: Configuring the aesthetics of reference line\r\n\r\n\r\n\r\nUnder Numbers, set the display a abbreviated numbers.  Set the number to 2 decimals.\r\n\r\n\r\n\r\nFigure 47: Rounding up the numbers displayed\r\n\r\n\r\n\r\nRepeat the above for Maximum and also for the Imports chart. The line will be red for Imports. The chart at this point will look like so:\r\n\r\n\r\n\r\nFigure 48: Intermediate Chart\r\n\r\n\r\n\r\nNext, we will set the color of the bar chart to be white, and only showing the border. Select blue for Export and red for Import This is done so that the colored bars do not overpower the chart and create redundant ink.\r\nSet the colors of the bars:\r\n\r\n\r\n\r\nFigure 49: Setting up the colors of the bar chart\r\n\r\n\r\n\r\nHide the axis for both chart. Right click on the axis/measure in the Rows shelf and un-check Show Header.\r\n\r\n\r\n\r\nFigure 50: Hide axis\r\n\r\n\r\n\r\nHide the field labels i.e. column labels. Right click on the label and select Hide Field Labels for Columns.\r\n\r\n\r\n\r\nFigure 51: Hide Field labels\r\n\r\n\r\n\r\nEdit the title. Right click on the chart and edit as show.\r\n\r\n\r\n\r\nFigure 52: Editing the title\r\n\r\n\r\n\r\nEdit the title as shown below. Bold and color the words Import and Export and this reinforces to the reader that red=Import and blue=Export.\r\n\r\n\r\n\r\nFigure 53: Inking text data\r\n\r\n\r\n\r\nEdit tool tips. Select the Tooltip box under All marks card. Make the changes as shown below: The rest of the text will be in grey and font size 10 while the values will be font size 12 Also, they will be color coded and bolded.  This is done as data inking.\r\n\r\n\r\n\r\nFigure 54: Setting font format for Tooltips\r\n\r\n\r\n\r\nNext, we will format the Tooltips number so that it only shows decimal places. First, right click on the variable in the Rows shelf and select Format.\r\n\r\n\r\n\r\nFigure 55: Formatting Tooltip number\r\n\r\n\r\n\r\nUnder both Axis and Pane, set the Number to only display 2 decimal places in the billions.\r\n\r\n\r\n\r\nFigure 56: Change in both Axis and Panes\r\n\r\n\r\n\r\nRepeat the process for all Tooltips measures.\r\nRemove the grid lines. All grid lines will be removed. Right click on an empty space in the chart, and select Format. Select None for all as shown below.\r\n\r\n\r\n\r\nFigure 57: Removing borders and dividers\r\n\r\n\r\n\r\nThis removes all the external borders and dividers. In order to remove the internal gridlines, we will do as follows:\r\n\r\n\r\n\r\nFigure 58: Removing chart gridlines\r\n\r\n\r\n\r\nThis is done as the grid lines are redundant ink. They have no purpose as any data required can be read directly through the Tooltips.\r\nChange all fonts, to Sitka and font size 10pt. Right click on the axis/reference line/title and select Format to change the font, font size and also to bold it.\r\n\r\n\r\n\r\nFigure 59: Changing aesthetics\r\n\r\n\r\n\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 60: Final Product of Overall Bar\r\n\r\n\r\n\r\n\r\nCreating the second chart: Overall Line chart\r\nDrag and drop the variables into the Rows and Columns. We will drag Balance of Trade twice. We do this so that one of the chart can serve as markers.\r\n\r\n\r\n\r\nFigure 61: Measures for Overall Line\r\n\r\n\r\n\r\nTwo charts will appear. Click on the axis of the bottom chart, and select Dual Axis and then synchronize them to ensure that the circles and line add up.\r\n\r\n\r\n\r\nFigure 62: Create a dual axis\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 63: Synchronize\r\n\r\n\r\n\r\nOn the Marks pane, on either one of the charts, change the chart type to Circle and set the color to black.  This is done so that the point along the lines are bigger and clearer and the user can hover over the points easily. Aesthetically, it is easier to track the points when the markers are larger.\r\n\r\n\r\n\r\nFigure 64: Setting the up the Circle chart\r\n\r\n\r\n\r\nLeave the other chart as a Line type.\r\nJust as we did earlier, the y-axis will be hidden (see figure 50) and we will only show 2 reference lines to increase the data-ink ratio.\r\nOne for maximum and one for minimum.\r\nSet the color to green and label it as “Highest/Lowest Trade Surplus: SGD ”\r\nThis is done so that the reader associates the color green for Trade Surplus.\r\n\r\nWe will truncate the y-axis to start from 15 billion.\r\n\r\n\r\n\r\nFigure 65: Truncating the y-axis\r\n\r\n\r\n\r\nMake the changes to the Tooltip as well as the title as we did for the previous chart.(see Figures 53 @ref(fig: 4-2-18)) This time using the color green to mark the Balance of Trade.\r\nSet the numbers to 2 decimal places for the tooltips (see Figure 55) and reference lines(see Figure 47)\r\nRemove all gridlines (see Figures 57) and axis lines (see Figures 58)) as we did earlier.\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 66: Final Product of Overall Line\r\n\r\n\r\n\r\n\r\nCreating the third chart: MOTP (1)\r\nThis chart is the re-visualization of the original chart.\r\nDrag and drop the variables into the Rows and Columns.\r\n\r\n\r\n\r\nFigure 67: Measures for Overall Line\r\n\r\n\r\n\r\nDrag and drop the Country variable into the detail box, as currently it is an aggregated point. This way each point will refer to a particular country.\r\n\r\n\r\n\r\nFigure 68: Adding Country to detail\r\n\r\n\r\n\r\nAdd filter for country.  This is done as we want to show the top 10 partners per year respective to Total Volume of Trade. Drag and drop Country into the Filters box.\r\n\r\n\r\n\r\nFigure 69: Add Country into Filters\r\n\r\n\r\n\r\nNext we will make the changes as shown below. This will sieve out the top 10 by the Total Volume of Trade by the year. We will configure the year filter in the following few steps later on.\r\n\r\n\r\n\r\nFigure 70: Filtering top 10 Countries by Total Volume\r\n\r\n\r\n\r\nDrag and drop Country into the shape box. This way we will be able to customize the icons.\r\n\r\n\r\n\r\nFigure 71: Add Country to shape to customise the icons\r\n\r\n\r\n\r\nOn the right pane, the shape legend will come up. Select Edit Shape.\r\n\r\n\r\n\r\nFigure 72: Edit Shape under Shape legend\r\n\r\n\r\n\r\nSelect relevant country icon pack. This icon pack was downloaded from Flaticon.com and Freepik.com.\r\n\r\n\r\n\r\nFigure 73: Adding custom icon pack\r\n\r\n\r\n\r\nCreating parameter. The year and quarter will be user toggled, hence we will create two parameters.\r\nClick on the arrow button in the Data pane and select Create Parameter.\r\n\r\n\r\n\r\nFigure 74: Create Parameter\r\n\r\n\r\n\r\nCreate the Year parameter\r\n\r\n\r\n\r\nFigure 75: Configuration for Year Parameter\r\n\r\n\r\n\r\nCreate the Quarter parameter\r\n\r\n\r\n\r\nFigure 76: Configuration for Quarter Parameter\r\n\r\n\r\n\r\n\r\nNext, we will create the calculated fields to link the parameter to.  Click on the arrow button in the Data pane and create 2 fields to be linked to the parameter.\r\nDate Filter\r\n\r\n\r\n\r\nFigure 77: Formula for Date Filter\r\n\r\n\r\n\r\nQuarter Filter\r\n\r\n\r\n\r\nFigure 78: Formula for Quarter Filter\r\n\r\n\r\n\r\n\r\nDrag and drop the Date Filter and Quarter Filter. Select True when the window, shown below, prompts upon dropping.\r\n\r\n\r\n\r\nFigure 79: Select True\r\n\r\n\r\n\r\nRight click on both filters and select Add to Context. This is so that Tableau applies the data and quarter filter before sorting out the top 10 values as Tableau follows an order of operations when applying filters.\r\n\r\n\r\n\r\nFigure 80: Add to context\r\n\r\n\r\n\r\nIn the Parameters Pane, right click on both year and quarter parameters to select Show Parameter\r\n\r\n\r\n\r\nFigure 81: Show parameters\r\n\r\n\r\n\r\nThe parameter pane will appear on the left to be toggled. However, this will be used for debugging purposes. The parameter controls will be the Year Buttons and Quarter buttons that will be created later on.\r\nEdit the title. Insert the dynamic parameter values so that the title changes according the the user selection.\r\n\r\n\r\n\r\nFigure 82: Create a dynamic title\r\n\r\n\r\n\r\nRemove all grid lines/headers/field labels as we did previously See figures:\r\nHiding Axis: 50\r\nOuter gridlines: 57\r\nInner gridlines: 58\r\nHide field labels: 51\r\n\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 83: Final product of MOTP(1)\r\n\r\n\r\n\r\n\r\nCreating the fourth chart: MOTP(2)\r\nThis chart will look similar to the Overall Bar Chart that we created previously. First drag and drop the variables into the Rows and Columns.\r\n\r\n\r\n\r\nFigure 84: Measures for MOTP(2)\r\n\r\n\r\n\r\nDrag and drop Date Filter, Qtr Filter and Country into the filters box.\r\nAdd Date Filter and Qtr Filter to context (see Figure 80)\r\nThe Country should be filtered by Total Volume of Trade as MOTP (1) would be linked to this chart as shown below.\r\n\r\n\r\n\r\nFigure 85: Filters to be added\r\n\r\n\r\n\r\n\r\nWe will invert the Import axis as we did earlier for the Overall Line Chart (see Figure 40)\r\nNow, we have to sort the chart so that it follows MOTP(1)’s countries. To do so, drag and drop Total Volume of Trade into the Rows shelf.\r\n\r\n\r\n\r\nFigure 86: Drag and drop Total Volume of Trade into Rows\r\n\r\n\r\n\r\nA third chart will appear below. Select the chart by clicking on the axis, and then select the sort button on the Toolbar above\r\n\r\n\r\n\r\nFigure 87: Select the chart\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 88: Sort in ascending, so that highest appears on the right\r\n\r\n\r\n\r\nBy doing so, the chart will now be sorted according to Total Volume of Trade. Once it is sorted, select the variable from the Rows shelf and drag it away effectively removing the third chart.\r\nSet the colors of the bar charts to white with only the borders colored, red for imports and blue for exports, the steps can be found above as we did for the Overall bar chart. (see Figure 49)\r\nAdd a reference line to label the chart area. Instead of using axis label, we will place the label in the background of the chart.\r\nRight click Export axis and make the following changes below. The average calculation is arbitrary, it can be any constant value as long as it places it somewhere in the middle of the chart. However, as the user toggles the filters, selecting a dynamic calculation will allow the reference line to be re-calculated and hence stay at the same relative position.\r\n\r\n\r\n\r\nFigure 89: Configuring the reference line\r\n\r\n\r\n\r\nOnce that is done, right click on the reference point and select Format Make the following changes:\r\n\r\n\r\n\r\nFigure 90: Formatting the reference line\r\n\r\n\r\n\r\nUnder Alignment. align the text to the left. Repeat for Imports, labeling it as “Imports” and also using the same color as the bar chart (red)\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 91: Final product for MOTP(2)\r\n\r\n\r\n\r\n\r\nCreating the fourth chart: Balance of Trade chart\r\nDrag and drop the variables into the Rows and Columns.\r\n\r\n\r\n\r\nFigure 92: Measures for Balance of Trade chart\r\n\r\n\r\n\r\nCreate 2 parameters, Top N and Bottom N. These parameters will be user toggled. This will give the user autonomy to see 1-15 top countries that Singapore is in surplus with and similar 1-15 top countries that Singapore is in deficit. This\r\n\r\n\r\n\r\nFigure 93: Configuring Top N\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 94: Configuring Bottom N\r\n\r\n\r\n\r\nRight click on the Country variable and create 2 sets, Top N by Parameter and Bottom N by Parameter. This way, the top N and bottom N values will be displayed.\r\n\r\n\r\n\r\nFigure 95: Creating a set\r\n\r\n\r\n\r\nCombine the two created sets and Create Combined Set.Click on the first parameter + CTRL + click on the second parameter.\r\n\r\n\r\n\r\nFigure 96: Combining the set\r\n\r\n\r\n\r\nDrag and drop the newly created set, Date Filter and Quarter Filter into the Filters box. Just as we did before, add Date Filter and Quarter Filter to context.(see Figure 80)  Next, click on the Sort button as show below.\r\n\r\n\r\n\r\nFigure 97: Sorting the combined set\r\n\r\n\r\n\r\nCreating dynamic labels.\r\nCreate calculated fields Trade Surplus and Trade Deficit.\r\n\r\n\r\n\r\nFigure 98: Create calculated field: Trade Surplus\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 99: Create calculated field: Trade Deficit\r\n\r\n\r\n\r\nDrag and drop the newly created field in the Label box.\r\n\r\n\r\n\r\nFigure 100: Drop Trade Surplus and Trade Deficit into Label\r\n\r\n\r\n\r\nClick on the box and edit that. We will use purple to denote for Trade Deficit and green Trade Surplus as we did for the Overall Line chart.\r\n\r\n\r\n\r\nFigure 101: Color coding\r\n\r\n\r\n\r\n\r\nSet the color of the bars to white and only display the black borders, just as we did previously.(see Figure @(fig:4-2-14A)) This allows the colors of the labels to be in contrast.\r\nEdit the axis\r\nSet the tick to a very large value as we will only show the zero mark.\r\n\r\n\r\n\r\nFigure 102: Removing additional ticks\r\n\r\n\r\n\r\nSet the range of the axis as the following so that the the bottom countries(negative values can be seen)\r\n\r\n\r\n\r\nFigure 103: Range of x-axis\r\n\r\n\r\n\r\n\r\nEdit the title as shown below, insert the parameters as we did earlier(see Figure 82)\r\n\r\n\r\n\r\nFigure 104: Editing the title\r\n\r\n\r\n\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 105: Final product of Balance of Trade Chart\r\n\r\n\r\n\r\n\r\nCreating the fifth chart: Overall Balance of Trade\r\nDrag and drop the variables into the Rows and Columns.\r\n\r\n\r\n\r\nFigure 106: Measures for Overall Balance of Trade\r\n\r\n\r\n\r\nDrag the drop the variables as shown below\r\n\r\n\r\n\r\nFigure 107: Page and Marks measures\r\n\r\n\r\n\r\nUnder the Year of Date controls that pop up on the right legend pane, make the following changes so that as the icons move along the years, and the user can see the trail. Select Show History and make the change:\r\n\r\n\r\n\r\nFigure 108: Trail settings\r\n\r\n\r\n\r\nAdd a filter so that the chart only shows the Top 15 and Bottom 15 countries that appear in the Balance of Trade chart.\r\n\r\n\r\n\r\nFigure 109: Country filter to be added\r\n\r\n\r\n\r\nEdit shape and add the country icon pack as we did earlier.(see Figure 71)\r\n\r\n\r\n\r\nFigure 110: Customizing shape icons\r\n\r\n\r\n\r\nEdit the tooltip as shown below\r\n\r\n\r\n\r\nFigure 111: Editing the tooltip\r\n\r\n\r\n\r\nAdding references to show the Surplus and Deficit areas. To keep redundant ink minimal, we will not shade in the area. Instead we will add in reference lines as we did before.\r\nSurplus Area The value at which the line will be placed it arbitrary.\r\n\r\n\r\n\r\nFigure 112: Configuring surplus reference line\r\n\r\n\r\n\r\nFormat the line as such:\r\n\r\n\r\n\r\nFigure 113: Formatting surplus reference line\r\n\r\n\r\n\r\nZero Line Just as we did before, instead of using the axis ruler, a reference line will be placed.\r\n\r\n\r\n\r\nFigure 114: Configuring zero reference line\r\n\r\n\r\n\r\nFormat the line as such:\r\n\r\n\r\n\r\nFigure 115: Formatting zero reference line\r\n\r\n\r\n\r\nDeficit Area The value at which the line will be placed it arbitrary.\r\n\r\n\r\n\r\nFigure 116: Configuring deficit reference line\r\n\r\n\r\n\r\nFormat the line as such:\r\n\r\n\r\n\r\nFigure 117: Formatting deficit reference line\r\n\r\n\r\n\r\n\r\nEdit the title\r\n\r\n\r\n\r\nFigure 118: Editing the title\r\n\r\n\r\n\r\nThe chart will look like so:\r\n\r\n\r\n\r\nFigure 119: Final product of Overall BOT chart\r\n\r\n\r\n\r\n\r\nCreating the Year buttons\r\nInstead of using the drop down for the parameter controls, we will create custom Year buttons for aesthetic purposes.\r\nDrag and drop the following in Columns.\r\n\r\n\r\n\r\nFigure 120: Measures for Year buttons\r\n\r\n\r\n\r\nChange the chart type to Shape and increase the size.\r\n\r\n\r\n\r\nFigure 121: Change shape and size\r\n\r\n\r\n\r\nDrag and drop Dates to the Label box and edit as shown below so that the Year is displayed in the center of the circle\r\n\r\n\r\n\r\nFigure 122: Add Dates to label\r\n\r\n\r\n\r\nClick on Tooltips and uncheck Show tooltips.\r\n\r\n\r\n\r\nFigure 123: Disabling tooltips\r\n\r\n\r\n\r\nRemove all gridlines/dividers so that only the circles will be visible.\r\n\r\n\r\n\r\nFigure 124: Removing all gridlines/dividors\r\n\r\n\r\n\r\nHide the Title/Axis/Field Labels etc.\r\nSet the color of the circle as white and border as black.\r\nThe buttons will look like so:\r\n\r\n\r\n\r\nFigure 125: Final product of Year buttons\r\n\r\n\r\n\r\nCreating the Quarter buttons\r\nCreate a calculated field Qtr Buttons. This is an arbitrary field to create values 0-4.\r\n\r\n\r\n\r\nFigure 126: Creating Quarter field\r\n\r\n\r\n\r\nDrag and drop the newly created variable into the Column pane. Click on the triangle drop down, set to Dimension. Click again and Edit Aliases.. as shown below.\r\n\r\n\r\n\r\nFigure 127: Setting to Dimension and Change Aliases\r\n\r\n\r\n\r\nDrag and drop Qtr Buttons into the label box.\r\n\r\n\r\n\r\nFigure 128: Add quarter labels\r\n\r\n\r\n\r\nEdit the aesthetics of the buttons and make the changes as we did for Year too.\r\n\r\n\r\n\r\nFigure 129: Formating the buttons\r\n\r\n\r\n\r\nThe buttons will look like so:\r\n\r\n\r\n\r\nFigure 130: Final product of Quarter buttons\r\n\r\n\r\n\r\nSetting Up the Dashboard\r\nOnce the charts have been positioned on the Dashboard, we will connect them. This will be done using Actions.\r\n\r\n\r\n\r\nThere will be 2 dynamics set using Actions.\r\nParameter Actions. Year Buttons and Qtr Buttons will be set using these. This will connect the values of the Year and Qtr buttons to the actual parameter selections. Under Actions (as shown above), select Add Action and then Change Parameter.\r\n\r\n\r\n\r\nSelect the corresponding Parameters that the button connects to as shown below.\r\n\r\n\r\n\r\n\r\n\r\n\r\nHighlight Action  2 highlight actions will be set.\r\nThe first one will be between Overall Bar and Overall Line. Any selection in either chart, will highlight the other charts at that particular year. Set the following settings. Under Actions (as shown above), select Add Action and then Highlight...\r\n\r\n\r\n\r\nSet the settings shown below.\r\n\r\n\r\n\r\nThe second highlight action will be between the other 3 charts. This would be set up such that any selection of a Country bubble, will highlight the country in the other 2 charts. This way the reader can select any particular country he wishes to see.\r\n\r\n\r\n\r\nAdding animations\r\nTo ensure that the charts transition smoothly, we will add animations.\r\nUnder Format, select Animations..\r\n\r\n\r\n\r\nWhen the Animations pane shows up on the right, make the following changes. It will be set to Slow so that the user can see the movements and track the ranking of the countries(via multi select) over time.\r\n\r\n\r\n\r\n5. Final Visualization\r\nThe final interactive dashboard looks as such:\r\n\r\n\r\n\r\nTo see the interactivity & animations:\r\nTableau Public Link\r\n6. Insights\r\nSingapore’s Balance of Trade has always been in a surplus.\r\nFrom 2011 to 2020, the surplus has increased by approximately 70% overall.\r\nIf we look at the total volume over the years, the volume of trade in 2020 (940 Billion) is approximately the same as that in 2011 (943 Billion). However, the Balance of Trade is much higher.\r\nThis tells us that Singapore’s has risen in export volume over the years.\r\nVolume of Trade Insights\r\nOnce a prominent Trade Partner of Singapore, Indonesia’s trade with Singapore has been on a decrease since 2014.\r\nIn 2011, total volume of Trade of Indonesia with Singapore was 81.56 Billion comparable to China’s 101.75 Billion, and was approximately 80% of the highest volume (Malaysia)\r\nIn 2020, total volume of Indonesia went to 48.82 billion, compared to China’s 136.20 billion, making it 35.8% of the highest volume (China)\r\nThe highest drop began in Quarter 3 of 2013.\r\nConsistently, Malaysia, China, United States and Hong Kong have been Singapore’s top trade partners over the years.\r\nWe can see China’s meteoric rise in the world reflected in Singapore’s trade too.\r\nFrom 2011, China has risen up, very quickly establishing itself by the third quarter of 2015 as Singapore’s biggest partner.\r\nWhile the top 9 countries rotate between, China, Hong Kong, Malaysia, Taiwan, United States, Indonesia, Japan, South Korea, and Thailand.\r\nThe 10th position is often changes. It is taken by U.A.E., Australia, India, Vietnam\r\nBalance of Trade Insights\r\nHong Kong has been in a trade surplus with Singapore consistently through the years.\r\nThe surplus has increased by approximately 11%.\r\nIn addition to a falling total trade volume with Indonesia, the trade surplus has also reduced over the years.\r\nFrom a surplus of 32 Billion in 2011 to 10.32 billion in 2020.\r\nSingapore was consistently in deficit with United States from 2011 - 2019. However, in 2020 Quarter 2, Singapore went into a surplus with United States, making United States the 6th highest surplus at 5.67 billion in 2020 overall\r\nWhile Vietnam is not in Singapore’s top 10 in terms of volume of trade, there is a sizeable trade surplus in the trade relationship. Consistently, approximately 20% of the largest surplus, ranging from 10-11 billion.\r\nTrade deficit has been consistently Taiwan and Saudi Arabia have been large, with Taiwan’s the largest since 2018.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-03-data-viz-makeover-2/images2/1-1-0A.png",
    "last_modified": "2021-06-20T02:37:58+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-24-my-first-post/",
    "title": "Data Viz Makeover 1",
    "description": "A Visualisation of Singapore's Top 6 Trade Partners 2019 & 2020",
    "author": [
      {
        "name": "Aryah U. Chopra",
        "url": "https://www.linkedin.com/in/aryahuc/"
      }
    ],
    "date": "2021-05-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1: Introduction\r\n2: Original Data Visualization2.1: Critique: Clarity\r\n2.1: Critique: Aesthetics\r\n\r\n3: Design Sketches\r\n4. Building the Alternative Design4.1 The Data\r\n4.2 Data Preparation\r\n4.3 Creating the Chart\r\n\r\n5. Final Visualization\r\n6. Insights\r\n\r\n1: Introduction\r\nThe data in this makeover is the Merchandise Trade volume of Singapore with it’s top 6 trade partners in 2019 and 2020.\r\nThe top 6 trade partners of Singapore are identified as:\r\nChina (Mainland)\r\nHong Kong\r\nMalaysia\r\nJapan\r\nTaiwan\r\nUnited States of America\r\nThis period of time is especially crucial (and interesting) as it is one of the most tumultuous times the world has faced, with nearly all sectors taking a massive hit – The COVID-19 Pandemic.\r\nThe data was retrieved from the Department of Statistics, Singapore (DOS).\r\n2: Original Data Visualization\r\nThe following is the original chart that was prepared:\r\n\r\n\r\n\r\nFigure 1: Original Chart\r\n\r\n\r\n\r\nThis visualization will be critiqued on two parameters: Clarity and Aesthetics.\r\n2.1: Critique: Clarity\r\nClarity is how clear/lucid the chart in it’s message to the reader. The information should be free of ambiguity and confusion.\r\nThe chart falters as such:\r\nTitle: The title of the graph says “2019 - 2020”. This creates a level of ambiguity as we’re not sure as to if it is 2019 and 2020, or Jan 2019 - Jan 2020 or Jun 2019 - Jun 2020 (see Japan).\r\nFor example, for the Japan panel, there is only the tick 2020 whereas for the others, there is 2019, 2020 and 2021.\r\nWe can deduce that is in both 2019 and 2020, based on majority of the panels, however, we are not able to confirm the start month.\r\nExample:\r\n\r\n\r\n\r\nFigure 2: Misleading Title\r\n\r\n\r\n\r\nMismatch of Axis: The x-axis is labeled as ‘Month of Period’, however, the ticks are labeled by the year.\r\nExample:\r\n\r\n\r\n\r\nFigure 3: Misleading x-axis\r\n\r\n\r\n\r\nMismatched Dual-Axis: The import and export y-axis scales are not synchronized, as a result it creates ambiguity.\r\nExample:\r\n\r\n\r\n\r\nFigure 4: Mismatched Dual Axis\r\n\r\n\r\n\r\nIn the case of Hong Kong:\r\nThere is the illusion that exports are only higher than the import volume across several time periods, however that is not the case. In fact, the exports are much higher than the imports.\r\nAlso, Hong Kong is a net importer of Singapore and that information is not immediately visible on the graph.\r\nIn the case of Taiwan:\r\nThere is the illusion that exports and imports are comparable. However, Taiwan is a net exporter of Singapore and that information is not visible at the first glance.\r\nSince the countries are all on separate and unsynchronized axis, it is hard to make comparison between them.\r\nFor example, if one were to study the chart carefully, we can see that there is a trade surplus with Hong Kong as compared to other countries that remained unchanged. This highlights a unique relationship between Hong Kong and Singapore. The same can be said of Taiwan.\r\nIn addition to that, there is we’re unable to see which country trades with Singapore the most.\r\nThere is no mention of the source of data. This makes it unclear to the user as to whether the chart comes from a reliable data source or not.\r\nThe chart fails to indicate that the values indicated on the charts are in fact in billions or the currency it is in. The raw data is actually scaled down by a thousand.\r\n2.1: Critique: Aesthetics\r\nAesthetics is the visual appeal of the graph.\r\nThe chart falters as such:\r\nThe alpha (opacity) ratio of the chart is too high. It creates a murky look to areas where the chart overlaps as shown below.\r\n\r\n\r\n\r\nFigure 5: Murky look\r\n\r\n\r\n\r\nThe compound line graph is perhaps not the correct visualization technique for this, and it is poorly executed as well.\r\nThe compound line graph is commonly used to show the proportion of components that make up some aggregate variable. As such, the differences between the points across a certain time period would give actual values.\r\nDue to the unsynchronized axis, the difference cannot be seen. As such, the purpose of using the compound line graph is defeated.\r\nA line graph would be a better and cleaner visualization choice.\r\nThe labels for each panel of the facet grid is larger than the title. In addition to that, the font type is also not standardized across the chart.\r\n\r\n\r\n\r\nFigure 6: Unchecked font sizes\r\n\r\n\r\n\r\nThe widths of each panel is not the same.\r\n\r\n\r\n\r\nFigure 7: Unequal Width of the Panel\r\n\r\n\r\n\r\nThe distance of the axis labels is also not standardized across the panels.\r\n\r\n\r\n\r\nFigure 8: Unequal distance of y-axis labels\r\n\r\n\r\n\r\n3: Design Sketches\r\nThe initial sketch of the chart:\r\n\r\n\r\n\r\nFigure 9: Initial Sketch\r\n\r\n\r\n\r\nIssues Addressed\r\nClarity - Point 1 The title will be concise, implying year 2019 and 2020. In addition to that, it will state that the import and export terms are relative to Singapore.\r\nClarity - Point 2 X-axis will be marked according to Month, with only the major ticks labeled. This will remove ambiguity from the previous design and also not crowd the axis too much.\r\nClarity - Point 3 & Point 4 The dual axis will by synchronized and shared between countries so that directly comparison can be made between countries as well as within their respective imports and exports.\r\nClarity - Point 5 The source of the data will included at the bottom of the chart. This will not only highlight that the data is from a reliable source, but also highlight that the import and export is relative to Singapore.\r\nClarity - Point 6 For the Import and Export values, the raw value in billions will be reflected and the currency will also be stated as (SGD).\r\nAesthetics - Point 1 & Point 2 A line chart will be used so that the movements of the graph are clear. In addition to that, another chart will be created, Export - Import, to see the difference in values which perhaps the earlier visualization tried to show using a compound line chart.\r\nAesthetics - Point 3 The label of the title will be larger than that of the countries as well as the font type.\r\nAesthetics - Point 4 & Point 5 The facet will be equally split into 6 panels, one for each country and the axis will be shared. This will ensure that they are of equal size.\r\n4. Building the Alternative Design\r\n4.1 The Data\r\nThe raw data is in .xlsx format.\r\nIt contains 2 sheets:\r\nT1 : Merchandise Imports by Region/Market, Monthly\r\nT2 : Merchandise Exports by Region/Market, Monthly\r\nThe figure below shows a snapshot of the data:\r\n\r\n\r\n\r\nFigure 10: Snapshot of the raw data\r\n\r\n\r\n\r\nThings to Note:\r\nData starts at Row 6\r\nThe dates are in columns i.e. data needs to be transposed\r\nThe 6 countries need to be filtered out\r\n4.2 Data Preparation\r\nFirst, launch the Tableau Desktop software.\r\nImport the Data. From the local directory where the Raw_Data.csv is saved, drag and drop into the homepage as shown:\r\n\r\n\r\n\r\nFigure 11: Tableau Start Page\r\n\r\n\r\n\r\nWe will see this screen once the data is loaded.\r\n\r\n\r\n\r\nFigure 12: Tableau Workspace\r\n\r\n\r\n\r\nAs discussed previously, since the data only begins at row 6 (and also has other information row 100 onwards), we will tick the Data Interpreter before dragging tables into the workspace.\r\n\r\n\r\n\r\nFigure 13: Data Interpreter\r\n\r\n\r\n\r\nThis Data Interpreter is able to identify the structure of the data and turn it into a proper format. The dates are however in columns, hence the interpreter will not be able to do anything and the dates will remain in string format until we change it(see Step 7)\r\nDrag T1 into the workspace. The data, highlighted in purple, will appear.\r\n\r\n\r\n\r\nFigure 14: T1 Data Preview\r\n\r\n\r\n\r\nCountry Filter\r\nSince, we only require the 6 countries, a filter will be applied.  The sequence steps are highlighted in the following:\r\nClick on the Add|Filter button and then Add..\r\n\r\n\r\n\r\nFigure 15: Adding filter\r\n\r\n\r\n\r\nSelect Variables and Click Ok\r\n\r\n\r\n\r\nFigure 16: Select Variables\r\n\r\n\r\n\r\nSelect all the 6 Countries that were listed: Mainland China, Malaysia, Hong Kong, Taiwan, United States, Japan\r\n\r\n\r\n\r\nFigure 17: Select Countries\r\n\r\n\r\n\r\nWe will see the filter added as shown below. Register the changes by clicking Ok\r\n\r\n\r\n\r\nFigure 18: Commit the changes\r\n\r\n\r\n\r\nPivot the table.\r\nSelect all the columns: Click the first column + shift + Click the last column.  Right click to get the drop down list as shown below, and select Pivot\r\n\r\n\r\n\r\nFigure 19: Pivot table\r\n\r\n\r\n\r\nNow, the data looks like:\r\n\r\n\r\n\r\nFigure 20: Output of Pivotted Table\r\n\r\n\r\n\r\nFormatting & Renaming the columns.\r\nFormatting:\r\nSelect the Abc icon (which indicates string format) on the top left hand corner of the date column as shown in Box.\r\nRight click and select Date. This will change the format of the column.\r\n\r\n\r\n\r\nFigure 21: Changing Date Format\r\n\r\n\r\n\r\nRenaming:\r\nRight click on the column one-by-one and select Rename. Rename the respective columns to Date, Import Value and Country\r\n\r\n\r\n\r\nFigure 22: Renaming the Columns\r\n\r\n\r\n\r\nThe data looks as shown below:\r\n\r\n\r\n\r\nFigure 23: Output after Rename & Format change\r\n\r\n\r\n\r\nDate Filter\r\nSince we only require years 2019 & 2020, we will add another filter.\r\nThe steps are shown below:\r\n\r\n\r\n\r\nFigure 24: Adding Year filter\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 25: Select Data variable\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 26: Selecting Years\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 27: Selecting 2019 & 2020\r\n\r\n\r\n\r\nSave the file as Import_Data.csv\r\nIn the top row of icons, click on Export Data to CSV as shown below:\r\n\r\n\r\n\r\nFigure 28: Commit the Changes\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 29: Exporting the Data\r\n\r\n\r\n\r\nRepeat the steps above for T2 and export the data as Export_Data.csv\r\nOpen a new session of Tableau and drag the newly created Import_Data.csv. Export_Data.csv will also appear.\r\nDrag the Import_Data.csv node into the workspace as shown.\r\n\r\n\r\n\r\nFigure 30: Drag Import_Data\r\n\r\n\r\n\r\nIf the Export_Data.csv file does not appear, go to Connections and click Add as shown below:\r\n\r\n\r\n\r\nFigure 31: Adding Export_Data.csv\r\n\r\n\r\n\r\nMerge the files. Now, we will merge the two .csv files on Date & Country. Double click on Import_data.csv in the workspace and then drag Export_Data.csv in. Next, click on the Venn Diagram icon add Date.\r\n\r\n\r\n\r\nFigure 32: Merging files\r\n\r\n\r\n\r\nThe data below will be updated and we will see as follows: We can see that the the icon in the Import_Data.csv node is updated to show that it is a merged table. Also, the columns are updated:\r\n\r\n\r\n\r\nFigure 33: Output of merge\r\n\r\n\r\n\r\nNext, we hide the two duplicate columns highlighted above in purple. Right click and select Hide\r\n\r\n\r\n\r\nFigure 34: Hide un-needed columns\r\n\r\n\r\n\r\nCreate aliases for country data\r\nRight click on the Country(Export_Data.csv) column and select Aliases...\r\nFor each of the countries, edit the countries and click ok.\r\n\r\n\r\n\r\nFigure 35: Create aliases\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 36: Type in the Country names\r\n\r\n\r\n\r\nCreate calculated fields\r\nAs the Export Value and Import Values are in thousands, we will scale it up by a factor of 1000 so that the raw values are reflected on the visualization.\r\nRight click on th Export Value (Thousands) column and select Create Calculated Field...  Next, we add the formula and label the calculation as Export Value. The process is shown below:\r\n\r\n\r\n\r\nFigure 37: Create calculated field: Scale up by thousand\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 38: Formula\r\n\r\n\r\n\r\nRepeat the process for the Import Value (Thousands) column and save it as Import Value\r\nWe will also create another calculated field called Export-Import:\r\n\r\n\r\n\r\nFigure 39: Create calculated field: Export-Import\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 40: Formula\r\n\r\n\r\n\r\n4.3 Creating the Chart\r\nOn the bottom left hand corner of window, click on the Sheet tab. This is where the chart is built.\r\nDrag and drop the variables (known as Measures in Tableau) into the are marked by Columns and Rows as shown below.\r\nWe want the country to be in the vertical panes, hence Columns and the export value on the horizontal panes, hence Rows.\r\n\r\n\r\n\r\nFigure 41: Create chart\r\n\r\n\r\n\r\nChange year to month parameter by clicking on the square icon and selecting Month.\r\n\r\n\r\n\r\nFigure 42: Change year to month\r\n\r\n\r\n\r\nCreate a dual axis\r\nHold and drag the Import Value to the right edge of the chart.\r\n\r\n\r\n\r\nFigure 43: Creating a dual axis\r\n\r\n\r\n\r\nOnce that is done, right click on the Import Value axis and select Synchronize Axis\r\n\r\n\r\n\r\nFigure 44: Synchronize axis\r\n\r\n\r\n\r\nA dual and synchronized axis allows us to compare the import and export for each country. This is especially useful in understanding the trade relationship between Singapore and the Country of interest.\r\nEditing the X-axis\r\nRight click on the x-axis and select Edit Axis.\r\n\r\n\r\n\r\nFigure 45: Edit x-axis\r\n\r\n\r\n\r\nNext we make the changes shown below:\r\nHere, we’re setting the start and end points of the axis so that there is no amguity of 2021 being included as mark on the chart when we label the ticks.\r\n\r\n\r\n\r\nFigure 46: General axis settings\r\n\r\n\r\n\r\nWe will set the major ticks at 6 months, and the minor ticks will not be labeled however, they will be shown on the chart.  This is done so that the data-ink ratio is not compromised. The information that the axis goes by month is evident and yet, unnecessary labeling and crowding of the axis is avoided.\r\n\r\n\r\n\r\nFigure 47: Tick marks axis settings\r\n\r\n\r\n\r\nOnce the changes have been made, close the window.\r\nRight click on the axis again and select Format....\r\n\r\n\r\n\r\nFigure 48: Formating x-axis\r\n\r\n\r\n\r\nWe will use abbreviations for the Month-Year labels, and orient them vertically. This does not clutter the axis. Make the following changes:\r\n\r\n\r\n\r\nFigure 49: Changes to x-axis format\r\n\r\n\r\n\r\nChanging the Chart Features\r\nSize of Line Chart: Select the All tab under the Marks card. Click the Size icon and toggle the sliding bar. We will increase the width of the line chart so that the data-ink ratio increases and there is not much white space.\r\n\r\n\r\n\r\nFigure 50: Changing size of line chart\r\n\r\n\r\n\r\nType of Line Chart: Under the All tab select Color and click on the line icon. This will show the data points. This is done so that the months can be easily traced.\r\n\r\n\r\n\r\nFigure 51: Adding points to line chart\r\n\r\n\r\n\r\nHide Column Label: We can hide the column labels as it the Country names are self explanatory Right click and select Hide Field Labels for Column.\r\n\r\n\r\n\r\nFigure 52: Hide field label\r\n\r\n\r\n\r\nEdit Title: Right click on the title and select Edit Title...\r\n\r\n\r\n\r\nFigure 53: Editing title\r\n\r\n\r\n\r\nThe title will clearly state that the country of reference is Singapore and the years in discussion are 2019 and 2020.\r\nThe title will also be centered as the country names are also centered.\r\n\r\n\r\n\r\nFigure 54: Title to Add\r\n\r\n\r\n\r\nAdding Export-Import Drag and drop Export-Import twice on to the Rows bar.\r\n\r\n\r\n\r\nFigure 55: Creating second chart\r\n\r\n\r\n\r\nNext, we will click on the lower y-axis (red chart) and select Dual Axis.\r\n\r\n\r\n\r\nFigure 56: Select Dual Axis\r\n\r\n\r\n\r\nSynchronize the axis\r\n\r\n\r\n\r\nFigure 57: Synchonize Axis\r\n\r\n\r\n\r\nNow, we will change the one of the chart into a bar chart. Under the Marks card, select SUM(Export-Import)(2) (either of them would be fine) and select from the drop down, Bar.\r\n\r\n\r\n\r\nFigure 58: Change to bar chart\r\n\r\n\r\n\r\nOnce that is done, drag the Export-Import variable into the Color box and reduce the opacity to approxmately 45%.\r\n\r\n\r\n\r\nFigure 59: Adding color gradient to bar chart\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 60: Changing opacity\r\n\r\n\r\n\r\nEdit the legend With the newly created bar chart, we will change t he color gradient so that it shows orange for negative values and purple for positive.\r\nThe steps are shown below:\r\n\r\n\r\n\r\nFigure 61: Settings for color gradient\r\n\r\n\r\n\r\nOnce that is done, we change the color and width of the line chart of the Export-Import chart.\r\nThe color of the line chart will follow the same color gradient as that of the bar chart, it will be created the same way as shown earlier, but this time dropping the measure onto the Color box in the line chart Marks card.\r\nTo go with the rest of the color scheme, the color for the line charts will also be changed. This so that there is a theme to the colors are they go well together.The color palette was decided using a color wheel that calculates 4 colors that would be in tetradic harmony.\r\nChanging the grid lines.\r\nRight click anywhere on the chart and select Format...\r\n\r\n\r\n\r\nFigure 62: Formatting gridlines\r\n\r\n\r\n\r\nMake the following changes to get only vertical lines and not horizontal\r\n\r\n\r\n\r\nFigure 63: Column settings\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 64: Row settings\r\n\r\n\r\n\r\nWe do this in order to increase the data-ink ratio by reducing the unneccessary gridlines.\r\nAnnotations will be made in the chart.\r\nTo do so, right click, select Annotate and Point to make the annotation.\r\n\r\n\r\n\r\nFigure 65: Row settings\r\n\r\n\r\n\r\nFor further formatting to change the annotation bubble shape, right click on the text box and select Format:\r\n\r\n\r\n\r\nFigure 66: Row settings\r\n\r\n\r\n\r\nWe select minimal shading(50%), with no borders but with a slightly darker grey dotted line with a dot at the end, as we want to make clear which data point is being highlighted.\r\nAdd captions that refer back to the data source.\r\nRight click on the bar right below the x-axis and select Caption. The caption box will appear and right click on that to make edits.\r\n\r\n\r\n\r\nFigure 67: Adding caption\r\n\r\n\r\n\r\nCurrently, the chart has lines extending outward as showing in the line highlighted in red.\r\n\r\n\r\n\r\nFigure 68: Extending lines on the Chart\r\n\r\n\r\n\r\nWe will remove those to increase the data-ink ratio: Right click on a whitespace on chart, and select Format... Make the following changes:\r\n\r\n\r\n\r\nFigure 69: Remove Row Header Line\r\n\r\n\r\n\r\n\r\n\r\n\r\nFigure 70: Remove Column Header Line\r\n\r\n\r\n\r\nThe final changes will be splitting this chart into two separate charts. At the bottom of the window, right click on the Sheet 1 tab and select duplicate:\r\n\r\n\r\n\r\nFigure 71: Duplicate sheet\r\n\r\n\r\n\r\nDouble click and rename the Sheet 1 as Import/Export and the duplicated sheet as Balance of Trade.\r\n\r\n\r\n\r\nFigure 72: Renaming the sheet\r\n\r\n\r\n\r\nNext, we will open the respective sheets and remove the other variables by right clicking and selecting remove.\r\n\r\n\r\n\r\nFigure 73: Remove variables\r\n\r\n\r\n\r\nImport/Export sheet We will retain the following:\r\n\r\n\r\n\r\nFigure 74: Import/Export Sheet variables\r\n\r\n\r\n\r\nBalance of Trade sheet We will retain the following:\r\n\r\n\r\n\r\nFigure 75: Balance of Trade Sheet variables\r\n\r\n\r\n\r\nIn the Balance of Trade chart, add the title as shown below:\r\n\r\n\r\n\r\nFigure 76: Balance of Trade chart title\r\n\r\n\r\n\r\nCreate a dashboard by going to the bottom of the window and selecting New Dashboard\r\n\r\n\r\n\r\nFigure 77: Adding Dashboard\r\n\r\n\r\n\r\nIn the dashboard, drag and drop the sheets as shown below:\r\n\r\n\r\n\r\nFigure 78: Adding charts to Dashboard\r\n\r\n\r\n\r\nHover over the edges of the chart to resize.\r\n5. Final Visualization\r\nThe final chart can be found here:\r\nTableau Public Link\r\nIt is as follows:\r\n\r\n\r\n\r\nFigure 79: Final Visualization\r\n\r\n\r\n\r\n6. Insights\r\nChina\r\nWe can see that during the period of January & February (both 2019 and 2020) trade falls sharply. This can be likely due to Chinese New Year celebrations during which many of the businesses are closed in China and Singapore.\r\nWhile the dip in Singapore’s imports can be observed in both 2019 and 2020, Singapore’s exports dipped in February 2020 and not February 2019.\r\nThis could be partly due to the lockdown in Wuhan, China brought on by the Covid-19 pandemic. The lockdown was imposed on 23rd of January 2020.\r\nThere is a spike later in August 2020 which can be likely due to the recovering economy in China and increased demand for non-oil domestic exports(Nodx)\r\n\r\nHong Kong\r\nHong Kong is a net importer\r\nThe trade surplus with Hong Kong increased from 2019 to 2020\r\nIn 2019, Singapore’s imports increase from the period of February to April however, in 2020, the peak was much lower. This would be possibly due to the Pandemic with both countries seeing an uptick\r\nWhile in the previous year, exports increase from March to May, in 2020, the exports took a sharp dive. This is due to the circuit breaker in Singapore.\r\n\r\nJapan\r\nWhile the Balance of Trade suggests a general deficit, Singapore exported more from April to September 2020. This could likely be due to the pandemic.\r\nWith China’s lockdown in response to the pandemic disrupting supply chain, Japan’s economy took a hit.\r\nMalaysia\r\nThe Balance of Trade is approximately around 200 million but after April 2020, there is an increasing trade deficit.\r\nThe large dip seen in April 2020 is due to the restriction on movement in Malaysia as a measure to curb the spread of Covid-19.\r\nSoon after, the trade picks up as Malaysia opens its economy.\r\nTaiwan\r\nTaiwan is a net exporter\r\nThe trade deficit had reduced slight in November-December 2019, however it has deepened since.\r\nThe dip in Taiwan’s exports to Singpapore in November - December 2019 was likely due to the uncertainty shrouded by the US-China trade war & weakened commodity prices\r\n\r\nUnited States of America\r\nTrade with the US has mostly in a deficit\r\nThe Covid-19 pandemic turned that trend in March 2020 as US battled the pandemic.\r\nIn addition to that, USA’s reliance on medical and pharmaceutical good also boosted Singapore’s exports.\r\nIn August 2020, Singapore’s exports boosted due to increase demand for non-electronic goods\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-24-my-first-post/images/Picture1.png",
    "last_modified": "2021-06-18T17:55:33+08:00",
    "input_file": {}
  }
]
